GopalSaraf/Practicals/PSDL/include/proc/pic16f18114.h
// Register: LATA
#define LATA LATA
extern volatile unsigned char           LATA                __at(0x018);
#ifndef _LIB_BUILD
asm("LATA equ 018h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned LATA0                  :1;
        unsigned LATA1                  :1;
        unsigned LATA2                  :1;
        unsigned                        :1;
        unsigned LATA4                  :1;
        unsigned LATA5                  :1;
    };
} LATAbits_t;
extern volatile LATAbits_t LATAbits __at(0x018);
// bitfield macros
#define _LATA_LATA0_POSN                                    0x0
#define _LATA_LATA0_POSITION                                0x0
#define _LATA_LATA0_SIZE                                    0x1
#define _LATA_LATA0_LENGTH                                  0x1
#define _LATA_LATA0_MASK                                    0x1
#define _LATA_LATA1_POSN                                    0x1
#define _LATA_LATA1_POSITION                                0x1
#define _LATA_LATA1_SIZE                                    0x1
#define _LATA_LATA1_LENGTH                                  0x1
#define _LATA_LATA1_MASK                                    0x2
#define _LATA_LATA2_POSN                                    0x2
#define _LATA_LATA2_POSITION                                0x2
#define _LATA_LATA2_SIZE                                    0x1
#define _LATA_LATA2_LENGTH                                  0x1
#define _LATA_LATA2_MASK                                    0x4
#define _LATA_LATA4_POSN                                    0x4
#define _LATA_LATA4_POSITION                                0x4
#define _LATA_LATA4_SIZE                                    0x1
#define _LATA_LATA4_LENGTH                                  0x1
#define _LATA_LATA4_MASK                                    0x10
#define _LATA_LATA5_POSN                                    0x5
#define _LATA_LATA5_POSITION                                0x5
#define _LATA_LATA5_SIZE                                    0x1
#define _LATA_LATA5_LENGTH                                  0x1
#define _LATA_LATA5_MASK                                    0x20

// Register: PIR0
#define PIR0 PIR0
extern volatile unsigned char           PIR0                __at(0x08C);
#ifndef _LIB_BUILD
asm("PIR0 equ 08Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INTF                   :1;
        unsigned                        :3;
        unsigned IOCIF                  :1;
        unsigned TMR0IF                 :1;
    };
} PIR0bits_t;
extern volatile PIR0bits_t PIR0bits __at(0x08C);
// bitfield macros
#define _PIR0_INTF_POSN                                     0x0
#define _PIR0_INTF_POSITION                                 0x0
#define _PIR0_INTF_SIZE                                     0x1
#define _PIR0_INTF_LENGTH                                   0x1
#define _PIR0_INTF_MASK                                     0x1
#define _PIR0_IOCIF_POSN                                    0x4
#define _PIR0_IOCIF_POSITION                                0x4
#define _PIR0_IOCIF_SIZE                                    0x1
#define _PIR0_IOCIF_LENGTH                                  0x1
#define _PIR0_IOCIF_MASK                                    0x10
#define _PIR0_TMR0IF_POSN                                   0x5
#define _PIR0_TMR0IF_POSITION                               0x5
#define _PIR0_TMR0IF_SIZE                                   0x1
#define _PIR0_TMR0IF_LENGTH                                 0x1
#define _PIR0_TMR0IF_MASK                                   0x20

// Register: PIR1
#define PIR1 PIR1
extern volatile unsigned char           PIR1                __at(0x08D);
#ifndef _LIB_BUILD
asm("PIR1 equ 08Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned NVMIF                  :1;
        unsigned CRCIF                  :1;
        unsigned SCANIF                 :1;
        unsigned ACTIF                  :1;
        unsigned CSWIF                  :1;
        unsigned OSFIF                  :1;
        unsigned TMR1IF                 :1;
        unsigned TMR1GIF                :1;
    };
} PIR1bits_t;
extern volatile PIR1bits_t PIR1bits __at(0x08D);
// bitfield macros
#define _PIR1_NVMIF_POSN                                    0x0
#define _PIR1_NVMIF_POSITION                                0x0
#define _PIR1_NVMIF_SIZE                                    0x1
#define _PIR1_NVMIF_LENGTH                                  0x1
#define _PIR1_NVMIF_MASK                                    0x1
#define _PIR1_CRCIF_POSN                                    0x1
#define _PIR1_CRCIF_POSITION                                0x1
#define _PIR1_CRCIF_SIZE                                    0x1
#define _PIR1_CRCIF_LENGTH                                  0x1
#define _PIR1_CRCIF_MASK                                    0x2
#define _PIR1_SCANIF_POSN                                   0x2
#define _PIR1_SCANIF_POSITION                               0x2
#define _PIR1_SCANIF_SIZE                                   0x1
#define _PIR1_SCANIF_LENGTH                                 0x1
#define _PIR1_SCANIF_MASK                                   0x4
#define _PIR1_ACTIF_POSN                                    0x3
#define _PIR1_ACTIF_POSITION                                0x3
#define _PIR1_ACTIF_SIZE                                    0x1
#define _PIR1_ACTIF_LENGTH                                  0x1
#define _PIR1_ACTIF_MASK                                    0x8
#define _PIR1_CSWIF_POSN                                    0x4
#define _PIR1_CSWIF_POSITION                                0x4
#define _PIR1_CSWIF_SIZE                                    0x1
#define _PIR1_CSWIF_LENGTH                                  0x1
#define _PIR1_CSWIF_MASK                                    0x10
#define _PIR1_OSFIF_POSN                                    0x5
#define _PIR1_OSFIF_POSITION                                0x5
#define _PIR1_OSFIF_SIZE                                    0x1
#define _PIR1_OSFIF_LENGTH                                  0x1
#define _PIR1_OSFIF_MASK                                    0x20
#define _PIR1_TMR1IF_POSN                                   0x6
#define _PIR1_TMR1IF_POSITION                               0x6
#define _PIR1_TMR1IF_SIZE                                   0x1
#define _PIR1_TMR1IF_LENGTH                                 0x1
#define _PIR1_TMR1IF_MASK                                   0x40
#define _PIR1_TMR1GIF_POSN                                  0x7
#define _PIR1_TMR1GIF_POSITION                              0x7
#define _PIR1_TMR1GIF_SIZE                                  0x1
#define _PIR1_TMR1GIF_LENGTH                                0x1
#define _PIR1_TMR1GIF_MASK                                  0x80

// Register: PIR2
#define PIR2 PIR2
extern volatile unsigned char           PIR2                __at(0x08E);
#ifndef _LIB_BUILD
asm("PIR2 equ 08Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR3IF                 :1;
        unsigned TMR3GIF                :1;
        unsigned TMR2IF                 :1;
        unsigned TMR4IF                 :1;
        unsigned                        :1;
        unsigned CCP1IF                 :1;
        unsigned CCP2IF                 :1;
    };
} PIR2bits_t;
