GopalSaraf/Practicals/PSDL/include/proc/pic16f18114.h
extern volatile PWM1S1P1Lbits_t PWM1S1P1Lbits __at(0x497);
// bitfield macros
#define _PWM1S1P1L_P1L_POSN                                 0x0
#define _PWM1S1P1L_P1L_POSITION                             0x0
#define _PWM1S1P1L_P1L_SIZE                                 0x8
#define _PWM1S1P1L_P1L_LENGTH                               0x8
#define _PWM1S1P1L_P1L_MASK                                 0xFF
#define _PWM1S1P1L_S1P1L_POSN                               0x0
#define _PWM1S1P1L_S1P1L_POSITION                           0x0
#define _PWM1S1P1L_S1P1L_SIZE                               0x8
#define _PWM1S1P1L_S1P1L_LENGTH                             0x8
#define _PWM1S1P1L_S1P1L_MASK                               0xFF

// Register: PWM1S1P1H
#define PWM1S1P1H PWM1S1P1H
extern volatile unsigned char           PWM1S1P1H           __at(0x498);
#ifndef _LIB_BUILD
asm("PWM1S1P1H equ 0498h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P1H                    :8;
    };
    struct {
        unsigned S1P1H                  :8;
    };
} PWM1S1P1Hbits_t;
extern volatile PWM1S1P1Hbits_t PWM1S1P1Hbits __at(0x498);
// bitfield macros
#define _PWM1S1P1H_P1H_POSN                                 0x0
#define _PWM1S1P1H_P1H_POSITION                             0x0
#define _PWM1S1P1H_P1H_SIZE                                 0x8
#define _PWM1S1P1H_P1H_LENGTH                               0x8
#define _PWM1S1P1H_P1H_MASK                                 0xFF
#define _PWM1S1P1H_S1P1H_POSN                               0x0
#define _PWM1S1P1H_S1P1H_POSITION                           0x0
#define _PWM1S1P1H_S1P1H_SIZE                               0x8
#define _PWM1S1P1H_S1P1H_LENGTH                             0x8
#define _PWM1S1P1H_S1P1H_MASK                               0xFF

// Register: PWM1S1P2
#define PWM1S1P2 PWM1S1P2
extern volatile unsigned short          PWM1S1P2            __at(0x499);
#ifndef _LIB_BUILD
asm("PWM1S1P2 equ 0499h");
#endif

// Register: PWM1S1P2L
#define PWM1S1P2L PWM1S1P2L
extern volatile unsigned char           PWM1S1P2L           __at(0x499);
#ifndef _LIB_BUILD
asm("PWM1S1P2L equ 0499h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P2L                    :8;
    };
    struct {
        unsigned S1P2L                  :8;
    };
} PWM1S1P2Lbits_t;
extern volatile PWM1S1P2Lbits_t PWM1S1P2Lbits __at(0x499);
// bitfield macros
#define _PWM1S1P2L_P2L_POSN                                 0x0
#define _PWM1S1P2L_P2L_POSITION                             0x0
#define _PWM1S1P2L_P2L_SIZE                                 0x8
#define _PWM1S1P2L_P2L_LENGTH                               0x8
#define _PWM1S1P2L_P2L_MASK                                 0xFF
#define _PWM1S1P2L_S1P2L_POSN                               0x0
#define _PWM1S1P2L_S1P2L_POSITION                           0x0
#define _PWM1S1P2L_S1P2L_SIZE                               0x8
#define _PWM1S1P2L_S1P2L_LENGTH                             0x8
#define _PWM1S1P2L_S1P2L_MASK                               0xFF

// Register: PWM1S1P2H
#define PWM1S1P2H PWM1S1P2H
extern volatile unsigned char           PWM1S1P2H           __at(0x49A);
#ifndef _LIB_BUILD
asm("PWM1S1P2H equ 049Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P2H                    :8;
    };
    struct {
        unsigned S1P2H                  :8;
    };
} PWM1S1P2Hbits_t;
extern volatile PWM1S1P2Hbits_t PWM1S1P2Hbits __at(0x49A);
// bitfield macros
#define _PWM1S1P2H_P2H_POSN                                 0x0
#define _PWM1S1P2H_P2H_POSITION                             0x0
#define _PWM1S1P2H_P2H_SIZE                                 0x8
#define _PWM1S1P2H_P2H_LENGTH                               0x8
#define _PWM1S1P2H_P2H_MASK                                 0xFF
#define _PWM1S1P2H_S1P2H_POSN                               0x0
#define _PWM1S1P2H_S1P2H_POSITION                           0x0
#define _PWM1S1P2H_S1P2H_SIZE                               0x8
#define _PWM1S1P2H_S1P2H_LENGTH                             0x8
#define _PWM1S1P2H_S1P2H_MASK                               0xFF

// Register: PWMLOAD
#define PWMLOAD PWMLOAD
extern volatile unsigned char           PWMLOAD             __at(0x49E);
#ifndef _LIB_BUILD
asm("PWMLOAD equ 049Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MPWM1LD                :1;
        unsigned MPWM2LD                :1;
    };
} PWMLOADbits_t;
extern volatile PWMLOADbits_t PWMLOADbits __at(0x49E);
// bitfield macros
#define _PWMLOAD_MPWM1LD_POSN                               0x0
#define _PWMLOAD_MPWM1LD_POSITION                           0x0
#define _PWMLOAD_MPWM1LD_SIZE                               0x1
#define _PWMLOAD_MPWM1LD_LENGTH                             0x1
#define _PWMLOAD_MPWM1LD_MASK                               0x1
#define _PWMLOAD_MPWM2LD_POSN                               0x1
#define _PWMLOAD_MPWM2LD_POSITION                           0x1
#define _PWMLOAD_MPWM2LD_SIZE                               0x1
#define _PWMLOAD_MPWM2LD_LENGTH                             0x1
#define _PWMLOAD_MPWM2LD_MASK                               0x2

// Register: PWMEN
#define PWMEN PWMEN
extern volatile unsigned char           PWMEN               __at(0x49F);
#ifndef _LIB_BUILD
asm("PWMEN equ 049Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MPWM1EN                :1;
        unsigned MPWM2EN                :1;
    };
} PWMENbits_t;
extern volatile PWMENbits_t PWMENbits __at(0x49F);
// bitfield macros
#define _PWMEN_MPWM1EN_POSN                                 0x0
#define _PWMEN_MPWM1EN_POSITION                             0x0
#define _PWMEN_MPWM1EN_SIZE                                 0x1
#define _PWMEN_MPWM1EN_LENGTH                               0x1
#define _PWMEN_MPWM1EN_MASK                                 0x1
#define _PWMEN_MPWM2EN_POSN                                 0x1
#define _PWMEN_MPWM2EN_POSITION                             0x1
#define _PWMEN_MPWM2EN_SIZE                                 0x1
#define _PWMEN_MPWM2EN_LENGTH                               0x1
#define _PWMEN_MPWM2EN_MASK                                 0x2

// Register: PWM2ERS
#define PWM2ERS PWM2ERS
extern volatile unsigned char           PWM2ERS             __at(0x50C);
#ifndef _LIB_BUILD
asm("PWM2ERS equ 050Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ERS                    :8;
    };
    struct {
        unsigned ERS0                   :1;
        unsigned ERS1                   :1;
        unsigned ERS2                   :1;
        unsigned ERS3                   :1;
    };
} PWM2ERSbits_t;
